tutorials/testTwoFluidRecurrenceTurbulence/testRecurrenceKEpsilon/init/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingTwoPhaseEulerFoam;

//startFrom       startTime;
startFrom       latestTime;

startTime       0;

//stopAt          writeNow;
stopAt          endTime;

// adjust copy commands in script createDataBase when changing this setting
endTime         30;

deltaT          0.0001;

// writeControl    runTime;
writeControl    adjustableRunTime;
//writeControl    timeStep;

writeInterval   0.1;

purgeWrite      20;

writeFormat     binary;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.35;

maxDeltaT       1;


functions
{
}

// ************************************************************************* //
